/// 64卦
enum Gua64 {
  qian(1, '乾为天'),
  kun(2, '坤为地'),
  zhun(3, '水雷屯'),
  meng(4, '山水蒙'),
  xu(5, '水天需'),
  song(6, '天水讼'),
  shi(7, '地水师'),
  bi(8, '水地比'),
  xiaoxu(9, '风天小畜'),
  lv(10, '天泽履'),
  tai(11, '天地泰'),
  pi(12, '地天否'),
  tongren(13, '天火同人'),
  dayou(14, '火天大有'),
  _(15, ''),
  _(16, ''),
  _(17, ''),
  _(18, ''),
  _(19, ''),
  _(20, ''),
  _(21, ''),
  _(22, ''),
  _(23, ''),
  _(24, ''),
  _(25, ''),
  _(26, ''),
  _(27, ''),
  _(28, ''),
  _(29, ''),
  _(30, ''),
  _(31, ''),
  _(32, ''),
  _(33, ''),
  _(34, ''),
  _(35, ''),
  _(36, ''),
  _(37, ''),
  _(38, ''),
  _(39, ''),
  _(40, ''),
  _(41, ''),
  _(42, ''),
  _(43, ''),
  _(44, ''),
  _(45, ''),
  _(46, ''),
  _(47, ''),
  _(48, ''),
  _(49, ''),
  _(50, ''),
  _(51, ''),
  _(52, ''),
  _(53, ''),
  _(54, ''),
  _(55, ''),
  _(56, ''),
  _(57, ''),
  _(58, ''),
  _(59, ''),
  _(60, ''),
  _(61, ''),
  _(62, ''),
  _(63, ''),
  _(64, ''),
  ;

  final String name;
  final int value;
  const Gua64(this.value, this.name);

  static int name2value(String name) {
    for (var dizhi in Gua64.values) {
      if (name == dizhi.name) return dizhi.value;
    }
    throw UnsupportedError('错误的64卦');
  }
}
