/// 64卦
enum Gua64 {
  qian_1(1, '乾为天'),
  kun_2(2, '坤为地'),
  zhun_3(3, '水雷屯'),
  meng_4(4, '山水蒙'),
  xu_5(5, '水天需'),
  song_5(6, '天水讼'),
  shi_7(7, '地水师'),
  bi_8(8, '水地比'),
  xiaoxu_9(9, '风天小畜'),
  lv_10(10, '天泽履'),
  tai_11(11, '天地泰'),
  pi_12(12, '地天否'),
  tongren_13(13, '天火同人'),
  dayou_14(14, '火天大有'),
  qian_15(15, '地山谦'),
  yu_16(16, '雷地豫'),
  sui_17(17, '泽雷随'),
  gu_18(18, '山风蛊'),
  lin_19(19, '地泽临'),
  guan_20(20, '风地观'),
  shihe_21(21, '火雷噬嗑'),
  bi_22(22, '山火贲'),
  bo_23(23, '山地剥'),
  _24(24, ''),
  _25(25, ''),
  _26(26, ''),
  _27(27, ''),
  _28(28, ''),
  _29(29, ''),
  _30(30, ''),
  _31(31, ''),
  _32(32, ''),
  _33(33, ''),
  _34(34, ''),
  _35(35, ''),
  _36(36, ''),
  _37(37, ''),
  _38(38, ''),
  _39(39, ''),
  _40(40, ''),
  _41(41, ''),
  _42(42, ''),
  _43(43, ''),
  _44(44, ''),
  _45(45, ''),
  _46(46, ''),
  _47(47, ''),
  _48(48, ''),
  _49(49, ''),
  _50(50, ''),
  _51(51, ''),
  _52(52, ''),
  _53(53, ''),
  _54(54, ''),
  _55(55, ''),
  _56(56, ''),
  _57(57, ''),
  _58(58, ''),
  _59(59, ''),
  _60(60, ''),
  _61(61, ''),
  _62(62, ''),
  _63(63, ''),
  _64(64, ''),
  ;

  final String name;
  final int value;
  const Gua64(this.value, this.name);

  static int name2value(String name) {
    for (var dizhi in Gua64.values) {
      if (name == dizhi.name) return dizhi.value;
    }
    throw UnsupportedError('错误的64卦');
  }
}
